tivnantu/esp32-for-fun-demo/sdkconfig.defaults
# LCDWiki ES3C35P：ESP32-S3R8，16 MB 外接 QSPI Flash + 8 MB 封装内 OPI PSRAM。
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 板载 Type-C 接至 ESP32-S3 原生 USB-Serial-JTAG，控制台走同一根线。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 可选子系统默认关闭，交付二进制只含已验证路径。
# 打开方式：idf.py menuconfig → 板级支持（ES3C35P）→ 可选子系统
# 全部打开后仍应能通过构建，见 scripts/check.sh 的三套配置构建。
CONFIG_BSP_ENABLE_TOUCH=n
CONFIG_BSP_ENABLE_RGB=n
CONFIG_BSP_ENABLE_BATTERY=n
CONFIG_BSP_ENABLE_SDCARD=n
CONFIG_BSP_ENABLE_AUDIO=n
